{
    "1": "Clue: drink of spirits getting us fired (4)//\n\nLet's think step by step.\nTypically a cryptic crossword has synonyms and wordplay indicators.\n'drink' can mean swallow, guzzle, sip.\n'fired' can mean laid off, shot, set ablaze.\n'drink of spirits' can mean shot.\nshot can also mean 'fired'.\nshot is 4 characters and therefore fits the character count.\nAnswer: SHOT",
    "2": "Clue: model of car and every train (5)//\n\nLet's think step by step.\nTypically a cryptic crossword has synonyms and wordplay indicators.\n'model of car' can mean ram, toyota model y, tesla model s, ford model f, ford model t.\n'every' can mean each, any, all.\n'train' can mean locomotive, wagon, educate, teach.\n'and' can mean an indicator signalling joining.\nt synonym of 'model of car' joined with each synonym of 'every' is teach.\nteach is a synonym of 'train'.\nteach is 5 characters and therefore fits the character count.\nAnswer: TEACH",
    "3": "Clue: one organising publicity for car on the radio (8)//\n\nLet's think step by step.\nTypically a cryptic crossword has synonyms and wordplay indicators.\n'one organising publicity' can mean advertiser, promoter, hype-man.\n'for' can mean belongs, four, pro.\n'car' can mean vehicle, motor car, wagon, automobile.\n'on the radio' indicates listening, can be a wordplay indicator referring to homophones.\npro which is a synonym of 'for' joined with moter which is a homophone of motor is promoter.\npromoter is a synonym of 'one organising publicity'.\npromoter is 8 characters and therefore fits the character count.\nAnswer: PROMOTER",
    "4": "Clue: not often seen dressed for rugby in oxford, having to work steadily (13)//\n\nLet's think step by step.\nTypically a cryptic crossword has synonyms and wordplay indicators.\n'not often seen' can mean rare, sparse, scarce, infrequent.\n'dressed' can mean clothed, covered, salad additive.\n'dressed for rugby' can mean in shorts.\n'having to work steadily' can mean apply, strive, persevere.\nin shorts which is a synonym for 'dressed for rugby' joined with upply which is a homophone of apply which can mean 'having to work steadily' is inshortsupply.\ninshortsupply is a synonym of 'not often seen'.\ninshortsupply is 13 characters and therefore fits the character count.\nAnswer: INSHORTSUPPLY",
    "5": "Clue: ecstasy in old forbidden city, looking where one shouldn't (7)//\n\nLet's think step by step.\nTypically a cryptic crossword has synonyms and wordplay indicators.\n'ecstasy' can mean pleasure, bliss, elation.\n'forbidden city' is a part of Beijing, China.\n'ecstasy' can also mean the drug MDMA or commonly known as e.\n'ecstasy in old forbidden city' can mean e in Beijing.\nBeijing is also called Peking.\ne in Peking can be peeking which is a synonym of 'looking where one shouldn't '.\npeeking is 7 characters and therefore fits the character count.\nAnswer: PEEKING",
    "6": "Clue: short test of ear internally reveals foreign objects (7)//\n\nLet's think step by step.\nTypically a cryptic crossword has synonyms and wordplay indicators.\n'short' can mean abbreviate, is probably a wordplay indicator.\n'test' can mean exam, experiment, check.\n'of ear' can mean otic, auricular.\n'short test' which is a synonym of exam can be shortened to exa.\nexa with otic which is a synonym of 'of ear' internally is exotica.\nexotica is a synonym of 'foreign objects'.\nexotica is 7 characters and therefore fits the character count.\nAnswer: EXOTICA",
    "7": "Clue: prominence for which mr toad's postured (7)//\n\nLet's think step by step.\nTypically a cryptic crossword has synonyms and wordplay indicators.\n'prominence' can mean fame, celebrity, eminence, stardom.\n'postured' can mean pose, stance, arrange.\n'postured' is probably a wordplay indicator referring to anagrams.\nstardom is an anagram of 'mr toad's' \nstardom is a synonym of 'prominence'\nstardom is 7 characters and therefore fits the character count.\nAnswer: STARDOM",
    "8": "Clue: investigation not right, brief rage leads to profound shift (9)//\n\nLet's think step by step.\nTypically a cryptic crossword has synonyms and wordplay indicators.\n'investigation' can mean enquiry, inspection, search.\n'rage' can mean anger, fury, rampage.\n'brief' is probably a wordplay indicator referring to abbreviation.\nso, 'brief rage' can be ange.\n'investigation not right' can mean remove right from investigation.\nsearch with right or r removed is seach.\nseach from 'investigation not right' joined with ange from 'brief rage' is seachange.\nseachange is a synonym of 'profound shift'\nseachange is 13 characters and therefore fits the character count.\nAnswer: SEACHANGE",
    "9": "Clue: irritate part of right leg (6)//\n\nLet's think step by step.\nTypically a cryptic crossword has synonyms and wordplay indicators.\n'irritate' can mean annoy, vex, irk, rankle.\n'part of right leg' can mean knee, foot, thigh, ankle.\n'part of' is probably a wordplay indicator meaning to take a part of.\na part of right ankle is rankle.\nrankle is a synonym of 'irritate'.\nrankle is 6 characters and therefore fits the character count.\nAnswer: RANKLE",
    "10": "Clue: broadcast opened with items from italy (11)//\n\nLet's think step by step.\nTypically a cryptic crossword has synonyms and wordplay indicators.\n'broadcast' can mean to transmit, relay spread.\n'broadcast' is probably a wordplay indicator referring to anagrams.\n'with' is probably a wordplay indicator referring to joining.\n'opened with items' can mean 'openeditems'.\npiedmontese is an anagram of 'openeditems'.\npiedmontese is a synonym of 'from italy'.\npiedmontese is 11 characters and therefore fits the character count.\nAnswer: PIEDMONTESE",
    "11": "Clue: confusion may be brought about by one's riddles, sir (14)//\n\nLet's think step by step.\nTypically a cryptic crossword has synonyms and wordplay indicators.\n'confusion' can mean uncertainty, hesitation, disorderliness, disorientation.\n'may be brought about by' is probably a wordplay indicator referring to anagrams.\ndisorderliness is an anagram of 'one's riddles, sir'\ndisorderliness is a synonym of confusion.\ndisorderliness is 14 characters and therefore fits the character count.\nAnswer: DISORDERLINESS"
}
